; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-82)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b14)
    (on b14 b7)
    (on b7 b3)
    (on-table b3)
    (clear b12)
    (on b12 b6)
    (on b6 b11)
    (on b11 b21)
    (on b21 b13)
    (on b13 b17)
    (on b17 b20)
    (on b20 b19)
    (on b19 b24)
    (on b24 b10)
    (on b10 b5)
    (on b5 b16)
    (on b16 b23)
    (on b23 b4)
    (on-table b4)
    (clear b2)
    (on-table b2)
    (clear b18)
    (on b18 b22)
    (on b22 b15)
    (on b15 b8)
    (on b8 b9)
    (on-table b9))
 (:goal (and 
(on-table b3) (on-table b9)
(on b6 b8)
))
)

; plan
1. (unstack b18 b22)
   deleted: (on b18 b22) (clear b18) (arm-empty)
   added: (holding b18) (clear b22)
   goals met: 2 of 3
2. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 3
3. (unstack b22 b15)
   deleted: (on b22 b15) (clear b22) (arm-empty)
   added: (holding b22) (clear b15)
   goals met: 2 of 3
4. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 3
5. (unstack b15 b8)
   deleted: (on b15 b8) (clear b15) (arm-empty)
   added: (holding b15) (clear b8)
   goals met: 2 of 3
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 3
7. (unstack b12 b6)
   deleted: (on b12 b6) (clear b12) (arm-empty)
   added: (holding b12) (clear b6)
   goals met: 2 of 3
8. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 3
9. (unstack b6 b11)
   deleted: (on b6 b11) (clear b6) (arm-empty)
   added: (holding b6) (clear b11)
   goals met: 2 of 3
10. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 3 of 3
